app/controllers/profile_controller.rb

  def index
  	@users = current_user.trackers.all
---
SELECT "trackers".* FROM "trackers" WHERE "trackers"."user_id" = ?  [["user_id", 1]]