app/controllers/trackers_controller.rb

  def show
  	@tracker = Tracker.find(params[:id])
---
SELECT  "trackers".* FROM "trackers" WHERE "trackers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]