app/views/trackers/show.html.erb

SELECT "points".* FROM "points" WHERE "points"."tracker_id" = ?  [["tracker_id", 1]]
---
          </tr>
        <% @tracker.points.each do |point| %>